applications/solvers/multiphase/interTempFoam/interTempFoam/validation/V2_stefan_melting/0.orig/alpha.solid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField uniform 0;

boundaryField
{
    leftWall        { type zeroGradient; }
    rightWall       { type zeroGradient; }
    top             { type symmetryPlane; }
    bottom          { type symmetryPlane; }
    frontAndBack    { type empty; }
}


// ************************************************************************* //
