applications/solvers/multiphase/interTempFoam/interTempFoam/validation/V2_stefan_melting/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;          // 1 atm

boundaryField
{
    leftWall        { type fixedFluxPressure; gradient uniform 0; value uniform 1e5; }
    rightWall       { type fixedFluxPressure; gradient uniform 0; value uniform 1e5; }
    top             { type symmetryPlane; }
    bottom          { type symmetryPlane; }
    frontAndBack    { type empty; }
}


// ************************************************************************* //
