applications/solvers/multiphase/interTempFoam/interTempFoam/validation/V2_stefan_melting/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interTempFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         54000;

deltaT          36;

writeControl    adjustableRunTime;

writeInterval   72;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.05;

maxAlphaCo      0.1;

//maxDeltaT       1e-7;


functions
{

    #sinclude   "sampling"
}

// ************************************************************************* //
