applications/solvers/multiphase/interTempFoam/interTempFoam/validation/V2_stefan_melting/system/sampling
// -*- C++ -*-

sampleSets
{
    type    sets;
    libs    (sampling);

    writeControl  timeStep;
    writeInterval 1;

    setFormat           raw;
    interpolationScheme cellPointFace;

    fields ( alpha.solid T mdot );

    sets
    {
        // 1-D Stefan comparison: full x-line at domain mid-height y=0.07 m.
        // Compare alpha.solid=0.5 contour position against
        //   xGamma(t) = 2*lambda*sqrt(alpha_l*t),   lambda≈0.468
        // and T-profile against analytical erf solution at t1/t2/t3.
        xLine
        {
            type    face;
            axis    x;
            start   (0.0   0.07  0.0005);
            end     (0.28  0.07  0.0005);
            nPoints 200;
        }
    }
}


// ************************************************************************* //
